{
  "num_nextn_predict_layers": 1,
  "architectures": [
    "Qwen2MTPForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_qwen2.Qwen2MTPConfig",
    "AutoModelForCausalLM": "modeling_qwen2.Qwen2MTPForCausalLM"
  },
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "hidden_act": "silu",
  "hidden_size": 896,
  "initializer_range": 0.02,
  "intermediate_size": 4864,
  "max_position_embeddings": 32768,
  "max_window_layers": 21,
  "model_type": "qwen2_mtp",
  "num_attention_heads": 14,
  "num_hidden_layers": 25,
  "num_key_value_heads": 2,
  "rms_norm_eps": 1e-06,
  "rope_theta": 1000000.0,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.48.3",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 168072
}
